//  lesyawidget
//
//  Created by mll
import SwiftUI
import WidgetKit
import Foundation
import StoreKit
import UIKit

struct CityData: Identifiable {
    let id = UUID()
    let name: String
    var sites: [CityData]?
    static func result() -> [CityData] {
        let pune3 = [CityData (name: "Нехай це буде нашим квестом 🤫\n\nЗнайди вірш з якого була взята твоя цитатка та прочитай його повністю!\n\nНижче ти зможеш прочитати біографію письменників, дізнатись з чиїх віршів ми взяли рядки.\nМова завжди з тобою.")]
        let pune2 = [CityData (name: "Андрухович Юрій Ігорович"), CityData(name: "Народився 13 березня 1960 року у Станіславі (нині Івано-Франківськ). Закінчив редакторське відділення Українського поліграфічного Інституту у Львові (1982) та вищі літературні курси. У 1985 році за результатами публікації двох книг віршів прийнятий у СП України, у 1991 році — за ідейним переконанням виходить зі складу Союзу письменників разом з декількома колегами і стає ініціатором установи Асоціації українських письменників.\n\nПисьменник активно займається громадською діяльністю. Має яскраво виражену громадянську позицію, підтримуючи європейську інтеґрацію України.")]
        let pune5 = [CityData (name: "Костенко Ліна Василівна"), CityData(name: "Народилася 19 березня 1930р. в м. Ржищеві під Києвом в учительській родині.\n\nБатька переслідували КДБ та перед війною кинули в табір. У 1936р. родина перебралася до Києва. Провчившись деякий час у Київському педагогічному інституті, у 1952р. стає студенткою Московського літературного інституту. Незабаром виходять перші збірки. Стала однією з найактивніших учасниць шістедяситників. Збірку «Зоряний інтеграл» заборонили цензурою. Однак письменницю не арештували. Отримала Державну премію України ім. Шевченка, премію фундації Антоновичів, премія Франчески Петрарки та медаль Святого Володимира. Стала лауреатом Міжнародної літературно-мистецької премії ім. Теліги, професором Києво-Могилянська академії. У 90-х роках перестала брати участь у громадському житті, відмовилася від звання Героя України. Лише в період «помаранчевої революції» у 2004р. на деякий час повернулась до громадського життя.")]
        let pune6 = [CityData (name: "Косач Лариса Петрівна"), CityData(name: "Народилася 25 лютого 1871 в місті Новограді-Волинському.\n\nВчилася у приватних учителів. У 6 років почала вчитися вишивати. 6 січня 1880р. дуже застудилася, початок тяжкої хвороби. Влітку 1883 року діагностували туберкульоз кісток, у жовтні цього ж року видалили кістки, уражені туберкульозом.\nПобувавши 1891 в Галичині, а пізніше й на Буковині, Українка познайомилася з багатьма визначними діячами Західної України. Історію кохання Лесі Українки часто розпочинають із Сергія Мержинського. Вимушені потребою лікування подорожі до Німеччини, Італії, Єгипту, кількаразові перебування на Кавказі, Одещині, в Криму збагатили її враження та сприяли розширенню кругозору письменниці. 7 серпня 1907 р. Леся Українка та Климент Квітка офіційно оформили шлюб у церкві.\nПомерла 19 липня 1913 року в Сурамі у віці 42 років.")]
        let pune7 = [CityData(name: "Стус Василь Семенович"), CityData(name: "Народився 6 січня 1938р. в хліборобській родині в с. Рахнівці на Вінниччині.\n\nПісля закінчення школи навчався в Донецькому педінституті. Далі вчителював, служив в армії, працював в газеті. За участь у протесті на прем’єрі фільму «Тіні забутих предків» виключили з аспірантури. Відтоді не надрукували жодного рядка. У 1965р. одружився з Валентиною Попелюх, та народився син Дмитро. У 1970р. на похороні Алли Горської звинуватив владу у її вбивстві. У 1972р. разом з іншими укр. поетам його було заарештовано й засуджено. Ув’язнення відбував у Мордовії. Після завершення основного терміну відправили у заслання. Після повернення відмовився від радянського громадянства. У 1979р. повертається та працює у Києві. У 1980р. знову був засуджений до 10 років ув’язнення та 5 років заслання.\n28 серпня 1985р. його відправили у карцер, де він оголосив голодування. У ніч із 3 на 4 вересня 1985р. помер.")]
        let pune1 = [CityData(name: " Симоненко Василь Андрійович"), CityData(name: "Народився 8 січня 1935р. у селищі Біївці Лубенського району на Полтавщині.\n\nБатьки були колгоспниками, усе дитинство пройшло на селі у важкі воєнні та повоєнні часи\nУлітку 1962р. міліціонери заарештували та жорстоко побили його. Відмовлялися друкувати твори, друзі відвернулися. На початку вересня 1963р ліг у лікарню, оскільки після побиття його мучили болі. Було діагностовано рак нирок. \nПомер 14 грудня 1963р. у 28 років.")]
        let pune4 = [CityData(name: "Шевченко Тарас Григорович"), CityData(name: "Народився 9 березня 1814 року у селі Моринці Звенигородського повіту Київської губернії в закріпаченій селянській родині.\n\nДитячі роки проходять у селі Кирилівка (Керелівка). Улітку 1836 р. він познайомився зі своїм земляком — художником І. Сошенком, а через нього — з Євгеном Гребінкою, В. Григоровичем і О. Венеціановим. Навесні 1838 р. Карл Брюллов та Василь Жуковський викупили молодого поета з кріпацтва. Незабаром став студентом Академії мистецтв. Першу збірку своїх поетичних творів видав 1840 року під назвою «Кобзар». У 1844 р. написав гостро політичну поему «Сон» («У всякого своя доля»), ставши на шлях безкомпромісної боротьби проти самодержавної системи тодішньої Російської Імперії. Заарештували 5 квітня 1847 р., відправили до петербурга й ув’язнили в казематі. Заслали в солдати до Оренбурга. У квітні 1850 р. Шевченка вдруге заарештовано і, після піврічного ув’язнення, запроторено в Новопетровський береговий форт. Звільнено з заслання у 1857 р. Навесні 1858 поет прибув до петербурга. Влітку 1859 року повернувся в Україну, якої вже 12 років не бачив. До останніх днів свого життя поет перебував під таємним поліційним наглядом.\n10 березня 1861 року Шевченко помер.")]
        let pune8 = [CityData(name: "Розвадовський Богдан"), CityData(name: "Народився 1 травня 2004 року у місті Івано-Франківськ. Навчається у Прикарпатському національному університеті на юридичному факультеті.\nСпочатку був бітмейкером і робив біти на замовлення, але згодом усвідомив, що хоче творити власну музику. 30 грудня 2020 вийшов перший український мініальбом «Холод» записаний спільно з SadNovelist. 28 жовтня 2022 вийшов спільний з Структура щастя сингл «Силуети», який став найвідомішим їх твором.\nЖанр: інді-поп, постпанк, синті-поп, готик-рок, нова хвиля.")]
        let pune9 = [CityData(name: "Новеліст"), CityData(name: "Івано-Франківський альтернативний проєкт, заснований у 2020 році. Музика виконавця балансує на межі постпанку, альтернативного року та трепу.\nІнформація згодом буде розширена.")]
        let pune10 = [CityData(name: "Алєкса"), CityData(name: "Сучасний, здебільшого, постпанк виконавець. Пише вірші і паралельно до цього створює пісні, які насичені її почуттями та переживаннями. Саме відвертість alekkksa намагається вилити у потік творчості.")]
        let pune11 = [CityData(name: "Шмальгаузен"), CityData(name: "Це театрально-музичний український гурт, що був створений в межах Університету театру, кіно і телебачення імені Карпенка-Карого. Почавши виступи у 2020 році, вони швидко набули популярності серед студентської аудиторії.\nЗгодом гурт зазнавав змін як у своїй концепції, так і у складі. Спочатку було більше акторства, а з часом більше музики. Schmalgauzen працює в жанрі пісенного мистецтва, в якому поєднуються театральні вистави та драматургія. Фактично, це синтез музики і акторської майстерності у гармонійному співвідношенні.\nВ різних програмах може бути більше акценту на театрі, а в інших — на музиці, так само, як і в їхніх піснях.")]
        let pune12 = [CityData(name: "Іздрик Юрій Романович"), CityData(name: "Народився в м. Калуш на Івано-Франківщині 16 серпня 1962.\nВ школі вчився на відмінно, любив математику, грав у шкільному ансамблі, тоді ж почав цікавитися літературою. Закінчив музичну школу по класу віолончелі та фортепіано. По закінченні школи вступив на навчання у Львівський політехнічний інститут. У 1989 р. розпочалася історія легендарного журналу — “Четвер”. Перші два номери були самвидавними. У 1990 р. Юрко запропонував Андруховичу разом випускати “Четвер”, на що той одразу ж погодився. Кілька років митці працювали над журналом разом. Дружні стосунки Ю.Андрухович та Ю.Іздрик підтримують до сьогодні.Вже другий рік поспіль Ю.Іздрик займається спільним музичним проектом з поетом та музикантом Григорієм Семенчуком “DrumТИатр”.\nЗараз живе і працює Калуші.")]
        let pune13 = [CityData(name: "Микола"), CityData(name: "Власний проект студента із Луцьку.\nНазва BaWN це абревіатура від Black and White Night. Стиль пісень - переважно постпанк.")]
        return [CityData(name: "Звідки взяті цитатки", sites: pune3),
                CityData (name: "Андрухович", sites: pune2),
                CityData (name: "alekkksa", sites: pune10),
                CityData (name: "BaWN", sites: pune13),
                CityData (name: "Іздрик", sites: pune12),
                CityData (name: "Костенко", sites: pune5),
                CityData (name: "Леся Українка", sites: pune6),
                CityData (name: "SadSvit", sites: pune8),
                CityData (name: "Sad Novelist", sites: pune9),
                CityData (name: "Shmalgauzen", sites: pune11),
                CityData (name: "Стус Василь", sites: pune7),
                CityData (name: "Симоненко", sites: pune1),
                CityData (name: "Шевченко", sites: pune4)]
    }
}

    
struct autorSheet: View {
    @EnvironmentObject var model: ContentModel
    @Environment(\.presentationMode) var presentationMode: Binding<PresentationMode>

    var body: some View {
        VStack {
            ZStack {
                Button(action: {
                    self.presentationMode.wrappedValue.dismiss()
                }) {
                    ZStack {
                        Text("Повернутись")
                            .foregroundColor( Color("ColorInverted"))
                            .font(.body)
                            .padding(12)
                            .background(Color("autorbut"), in: RoundedRectangle(cornerRadius: 16, style: .continuous))
                    }
                }
                .padding(.top, 10)
                .padding(.horizontal, -180)
            }
            .frame(width: 800, height: 80)
           // .background(Color(UIColor.systemGray6))

            NavigationView {
                List{
                                           
                                           Section{
                                               VStack{
                                                   Text("Нехай назва та імʼя автора будуть для тебе квестом 🤫")
                                                       .leftAligned()
                                                   Divider()
                                                   Text("Знайди вірш з якого була взята твоя цитатка та  **прочитай його повністю**!")
                                                       .leftAligned()
                                               }
                                               
                                           }
                                           
                                           
                                           Section{
                                               Text("Нижче ти зможеш познайомитись з **біографіями** поетів та музичних гуртів, дізнатись більше про видатних творців твоєї країни.")
                                           }
                                           
                                           ForEach(Array(CityData.result().dropFirst())) { city in
                                               Section (header: EmptyView()) {
                                                   OutlineGroup (city, children: \.sites) { site in
                                                       Text (site.name)
                                                   }
                                                  // .bold()
                                               }
                                           }
                    Text("Усі музиканти надали дозвіл на використання їх рядків у додатку.")
                                        Text("Якщо ти музикант або поет та хочеш потрапити в додаток - напиши нам в будь-яку соціальну мережу.")
                                           
                                       }
                .foregroundColor( Color("ColorInverted"))
                .navigationBarBackButtonHidden(true)
                .padding(.top, -30)
                .gesture(DragGesture()
                    .onEnded { value in
                        if value.translation.width > 120 {
                            // Swipe left detected, close the sheet
                            self.presentationMode.wrappedValue.dismiss()
                        }
                    }
                )
            }
            .navigationBarBackButtonHidden(true)
        }
        .background(Color("colforau"))
    }
}

struct autorSheet_Previews: PreviewProvider {
    static var previews: some View {
        autorSheet()
            .environmentObject(ContentModel())
            .dynamicTypeSize(.medium)
    }
}
